/* NSButton (Automatically check for updates) : <title:Automatically check for updates> (oid:22) */
"Automatically check for updates" = "בדוק זמינות עדכונים באופן אוטומטי";

/* NSButton (Download) : <title:Download> (oid:7) */
"Download" = "הורד";

/* NSButton (Later) : <title:Later> (oid:8) */
"Later" = "אחר כך";

/* NSTextField (New version available) : <title:New version available> (oid:10) */
"New version available" = "גרסא חדש קיימת";

/* NSWindow (Update) : <title:Update> (oid:5) */
"Update" = "עדכן";

